# MacOSX system config
# manually run 'brew tap Homebrew/bundle'
# needed for command 'brew bundle' to exec the Brewfile

# Support for installing casks (desktop applications/3rd-party repos)
tap 'homebrew/cask' # install applications via Homebrew
tap 'homebrew/services' # service manager

# Text editors
brew 'vim'

# IDE's
cask 'visual-studio-code'

# Programming lanaguages, language-specific package managers, and source control
brew 'git'
brew 'python3'
brew 'go'

# Shell environment - then oh-my-zsh is installed afterwards
brew 'zsh'
brew "zsh-autosuggestions"
brew 'zsh-syntax-highlighting'

# CLI utilities
brew 'coreutils'
brew 'curl'
brew 'gpg'
brew 'nmap'
brew 'openssl'
brew 'watch'
brew 'wget'
brew 'xz'

# the "cloud"
brew 'kubernetes-cli'
brew 'terraform'
#cask 'docker'

# Visualization
brew 'jq'
brew 'neofetch'
brew 'yq'

# Window manager and hotkey-daemon
tap 'koekeishiya/formulae'
brew 'chunkwm'

cask 'kap'
cask '1password'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'viscosity'

### mpmsimo specific config
# Personal Casks
#cask 'discord'
#cask 'steam'
#cask 'vlc'
#cask 'ngrok'
#cask 'virtualbox'

#brew 'graphviz' # for terraform graph functionality
#brew 'awscli'
#brew 'hub'

#mas "Flycut", id: 442160987
