#MacOSX system config
#3/13/17
#mpmsimo

# manually run 'brew tap Homebrew/bundle'
# needed for command 'brew bundle' to exec the Brewfile

# Text editors
brew 'vim'

# Programming lanaguages, language-specific package managers, and source control
brew 'python3'
brew 'go'
brew 'glide'
brew 'git'

# ZSH shell environment - then oh-my-zsh is installed afterwards
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Terminal multiplexer
brew 'tmux'

# dotfiles things
brew 'neofetch'

# Sysadmin/useful packages
brew 'curl'
brew 'wget'
brew 'openssl'
brew 'xz'
brew 'gpg'
brew 'hub'

# Automation
brew 'kubernetes-cli'
brew 'awscli'
brew 'terraform'
brew 'graphviz' # for terraform graph functionality

# Virtualization
cask 'virtualbox'

# Support for installing casks (desktop applications/3rd-party repos)
tap 'caskroom/homebrew-cask'
tap 'homebrew/services' # service manager

# Window manager and hotkey-daemon
tap 'koekeishiya/formulae'
brew 'chunkwm'

# Install application casks
cask 'slack'
cask 'iterm2'
cask 'java'
cask 'google-chrome'
cask 'spotify'
cask '1password'
cask 'discord'
cask 'sublime-text'
cask 'viscosity'
