# MacOSX system config
# manually run 'brew tap Homebrew/bundle'
# needed for command 'brew bundle' to exec the Brewfile

# Support for installing casks (desktop applications/3rd-party repos)
tap 'caskroom/homebrew-cask'
tap 'homebrew/services' # service manager

# Text editors
brew 'vim'
cask 'sublime-text'

# IDE's
#cask 'atom'
#cask 'intellij-idea-ce'
cask 'visual-studio-code'

# Programming lanaguages, language-specific package managers, and source control
brew 'git'
brew 'glide'
brew 'go'
brew 'gotags'

brew 'python3'

cask 'java8'
brew 'jenv'
brew 'maven'

# Shell environment - then oh-my-zsh is installed afterwards
brew 'sshrc'
brew 'zsh'
brew "zsh-autosuggestions"
brew 'zsh-syntax-highlighting'

# CLI utilities
brew 'coreutils'
brew 'curl'
brew 'gpg'
brew 'nmap'
brew 'openssl'
brew 'watch'
brew 'wget'
brew 'xz'

# 3rd-party CLI utilities
brew 'awscli'
brew 'graphviz' # for terraform graph functionality
brew 'hub'
brew 'kubernetes-cli'
brew 'terraform'
#cask 'docker'

brew 'jq'
brew 'neofetch'
brew 'yq'

# Kubernetes
tap 'derailed/k9s'
brew 'k9s'

# Window manager and hotkey-daemon
tap 'koekeishiya/formulae'
brew 'chunkwm'

# Install application casks
cask 'ngrok'
cask 'virtualbox'

cask 'kap'
cask '1password'
cask 'discord'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
#cask 'steam'
cask 'viscosity'
cask 'vlc'

#mas "Flycut", id: 442160987
