# MacOSX system config
# manually run 'brew tap Homebrew/bundle'
# needed for command 'brew bundle' to exec the Brewfile

# Support for installing casks (desktop applications/3rd-party repos)
tap 'homebrew/cask' # install applications via Homebrew
tap 'homebrew/services' # service manager

# Terminal, window manager and hotkey-daemon
cask 'kitty'
tap 'koekeishiya/formulae'
brew 'koekeishiya/formulae/skhd'
brew 'yabai'

# Text editors
brew 'nvim'
cask 'sublime-text'

# Programming lanaguages, language-specific package managers, and source control
brew 'git'
brew 'go'
brew 'dep'

# Shell environment - then oh-my-zsh is installed afterwards
brew "zsh-autosuggestions"
brew 'zsh-syntax-highlighting'

# CLI utilities / debugging
brew 'coreutils'
brew 'curl'
brew 'openssl'
brew 'wget'
brew 'xz'
cask 'ngrok'
brew 'neofetch'

# the "cloud"
brew 'kubernetes-cli'
cask 'google-cloud-sdk'
cask 'docker'

# terraform
brew 'terraform'
brew 'terraform-docs'
brew 'terragrunt'

# Visualization
brew 'jq'
brew 'neofetch'
brew 'yq'

# Applications
cask '1password'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'viscosity'

### mpmsimo specific config
# Personal Casks
#cask 'discord'
#cask 'steam'
#cask 'vlc'
#cask 'virtualbox'
#brew 'graphviz' # for terraform graph functionality
